// Задача вводим год рождения {2000} , вывод сколько лет {23} 
// let year = +prompt("Year of birth");
// console.log(2023 - year);


// Задача. Запросить у пользователя число.
// Если введенное пользователем число больше чем 100, то в консоли отображаем "More"
// Если равно то вывыести "It's 100"
// Если меньше чем 100, то в консоли отобразить "Less"

// const number = +prompt("Number");
// if(number > 100) {
//     console.log("More");
// }
// else if (number == 100){
//     console.log("It's 100");
// }
// else {
//     console.log("Less");
// }


// Задача. Попросить пользователя ввести год рождения 
// a) Если ему больше или равно 18, то в консоли отобразить "Allowed"
// b) Если ему меньше 18, то в консоли отобразить "Forbidden"

// let year = +prompt("Year of birth ?");
// let age = 2023 - year;
// if(age >= 18) {
//     console.log("Allowed");
// }
// else {
//     console.log("Forbidden");
// }



// Задача. Ввести цену товара 
// a) Если больше 1000 но меньше 1500 то скидка 15%
// b) Если больше 1500 то скидка 20%
// с) Если меньше 1000 то скидки не будет 


// let price = +prompt("Product price");
// if(price > 1000 && price < 1500) {
//     console.log("Your dicsount 15%");
// }
// else if (price > 1500){
//     console.log("Your dicsount 20%");
// }
// else {
//     console.log("Not dicsount");
// }


// Задача если товар находится в категории телефон или ноутбук то отоброжать скидка есть 

// const category1 = "phone";
// const category2 = "laptop";

// const product = "phone"
// if ( product == category1 || product == category2) {
//     console.log("Discount");
// }

/* Условие - условное ветвление - if/else

    if(условие) {
        // действие. будет выполнено только если условие верно
    } else if(условие) {
        // действие. будет выполнено, если 1 условие неверное, а второе условие вреное
    } else {
        // действие. будет выполненно только если условие неверно
    }

    = - оператор присваивания

    операторы сравнение:
        > - больше
        < - меньше
        >= - больше или равно
        <= - меньше или равно
        == - равно

*/